<?xml version="1.0"?>
<CastXML format="1.1.5">

  <Struct id="_328" name="" context="_1" location="f4:870" file="f4" line="870" members="_632 _633 _634" size="96" align="32"/>
  <Typedef id="_329" name="sk_webpencoder_options_t" type="_635" context="_1" location="f4:874" file="f4" line="874"/>
  <Struct id="_330" name="sk_rrect_t" context="_1" location="f4:875" file="f4" line="875" incomplete="1"/>
  <Typedef id="_331" name="sk_rrect_t" type="_636" context="_1" location="f4:875" file="f4" line="875"/>
  <Enumeration id="_332" name="sk_rrect_type_t" context="_1" location="f4:877" file="f4" line="877" size="32" align="32">
    <EnumValue name="EMPTY_SK_RRECT_TYPE" init="0"/>
    <EnumValue name="RECT_SK_RRECT_TYPE" init="1"/>
    <EnumValue name="OVAL_SK_RRECT_TYPE" init="2"/>
    <EnumValue name="SIMPLE_SK_RRECT_TYPE" init="3"/>
    <EnumValue name="NINE_PATCH_SK_RRECT_TYPE" init="4"/>
    <EnumValue name="COMPLEX_SK_RRECT_TYPE" init="5"/>
  </Enumeration>
  <Typedef id="_333" name="sk_rrect_type_t" type="_637" context="_1" location="f4:884" file="f4" line="884"/>
  <Enumeration id="_334" name="sk_rrect_corner_t" context="_1" location="f4:886" file="f4" line="886" size="32" align="32">
    <EnumValue name="UPPER_LEFT_SK_RRECT_CORNER" init="0"/>
    <EnumValue name="UPPER_RIGHT_SK_RRECT_CORNER" init="1"/>
    <EnumValue name="LOWER_RIGHT_SK_RRECT_CORNER" init="2"/>
    <EnumValue name="LOWER_LEFT_SK_RRECT_CORNER" init="3"/>
  </Enumeration>
  <Typedef id="_335" name="sk_rrect_corner_t" type="_638" context="_1" location="f4:891" file="f4" line="891"/>
  <Struct id="_336" name="sk_textblob_t" context="_1" location="f4:893" file="f4" line="893" incomplete="1"/>
  <Typedef id="_337" name="sk_textblob_t" type="_639" context="_1" location="f4:893" file="f4" line="893"/>
  <Struct id="_338" name="sk_textblob_builder_t" context="_1" location="f4:894" file="f4" line="894" incomplete="1"/>
  <Typedef id="_339" name="sk_textblob_builder_t" type="_640" context="_1" location="f4:894" file="f4" line="894"/>
  <Struct id="_340" name="" context="_1" location="f4:896" file="f4" line="896" members="_641 _642 _643 _644" size="256" align="64"/>
  <Typedef id="_341" name="sk_textblob_builder_runbuffer_t" type="_645" context="_1" location="f4:901" file="f4" line="901"/>
  <Struct id="_342" name="" context="_1" location="f4:903" file="f4" line="903" members="_646 _647 _648 _649" size="128" align="32"/>
  <Typedef id="_343" name="sk_rsxform_t" type="_650" context="_1" location="f4:908" file="f4" line="908"/>
  <Function id="_344" name="sk_refcnt_unique" returns="_651" context="_1" location="f5:17" file="f5" line="17" mangled="_Z16sk_refcnt_unique">
    <Argument name="refcnt" type="_652" location="f5:17" file="f5" line="17"/>
  </Function>
  <Function id="_345" name="sk_refcnt_get_ref_count" returns="_360" context="_1" location="f5:18" file="f5" line="18" mangled="_Z23sk_refcnt_get_ref_count">
    <Argument name="refcnt" type="_652" location="f5:18" file="f5" line="18"/>
  </Function>
  <Function id="_346" name="sk_refcnt_safe_ref" returns="_653" context="_1" location="f5:19" file="f5" line="19" mangled="_Z18sk_refcnt_safe_ref">
    <Argument name="refcnt" type="_654" location="f5:19" file="f5" line="19"/>
  </Function>
  <Function id="_347" name="sk_refcnt_safe_unref" returns="_653" context="_1" location="f5:20" file="f5" line="20" mangled="_Z20sk_refcnt_safe_unref">
    <Argument name="refcnt" type="_654" location="f5:20" file="f5" line="20"/>
  </Function>
  <Function id="_348" name="sk_nvrefcnt_unique" returns="_651" context="_1" location="f5:22" file="f5" line="22" mangled="_Z18sk_nvrefcnt_unique">
    <Argument name="refcnt" type="_655" location="f5:22" file="f5" line="22"/>
  </Function>
  <Function id="_349" name="sk_nvrefcnt_get_ref_count" returns="_360" context="_1" location="f5:23" file="f5" line="23" mangled="_Z25sk_nvrefcnt_get_ref_count">
    <Argument name="refcnt" type="_655" location="f5:23" file="f5" line="23"/>
  </Function>
  <Function id="_350" name="sk_nvrefcnt_safe_ref" returns="_653" context="_1" location="f5:24" file="f5" line="24" mangled="_Z20sk_nvrefcnt_safe_ref">
    <Argument name="refcnt" type="_656" location="f5:24" file="f5" line="24"/>
  </Function>
  <Function id="_351" name="sk_nvrefcnt_safe_unref" returns="_653" context="_1" location="f5:25" file="f5" line="25" mangled="_Z22sk_nvrefcnt_safe_unref">
    <Argument name="refcnt" type="_656" location="f5:25" file="f5" line="25"/>
  </Function>
  <Function id="_352" name="sk_colortype_get_default_8888" returns="_46" context="_1" location="f5:29" file="f5" line="29" mangled="_Z29sk_colortype_get_default_8888"/>
  <FundamentalType id="_353" name="__int128" size="128" align="128"/>
  <FundamentalType id="_354" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_355" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_657 _658 _659 _660" size="256" align="64"/>
  <PointerType id="_356" type="_661" size="64" align="64"/>
  <ArrayType id="_357" min="0" max="0" type="_662"/>
  <FundamentalType id="_358" name="long long int" size="64" align="64"/>
  <FundamentalType id="_359" name="long long unsigned int" size="64" align="64"/>
  <FundamentalType id="_360" name="int" size="32" align="32"/>
  <FundamentalType id="_361" name="unsigned int" size="32" align="32"/>
  <FundamentalType id="_362" name="short int" size="16" align="16"/>
  <FundamentalType id="_363" name="short unsigned int" size="16" align="16"/>
  <FundamentalType id="_364" name="signed char" size="8" align="8"/>
  <FundamentalType id="_365" name="unsigned char" size="8" align="8"/>
  <FundamentalType id="_366" name="long int" size="64" align="64"/>
  <FundamentalType id="_367" name="long unsigned int" size="64" align="64"/>
  <FundamentalType id="_368" name="long double" size="128" align="128"/>
  <ElaboratedType id="_369" type="_39"/>
  <ElaboratedType id="_370" type="_41"/>
  <ElaboratedType id="_371" type="_45"/>
  <ElaboratedType id="_372" type="_47"/>
  <ElaboratedType id="_373" type="_49"/>
  <ElaboratedType id="_374" type="_51"/>
  <ElaboratedType id="_375" type="_53"/>
  <Field id="_376" name="x" type="_663" context="_55" access="public" location="f4:95" file="f4" line="95" offset="0"/>
  <Field id="_377" name="y" type="_663" context="_55" access="public" location="f4:96" file="f4" line="96" offset="32"/>
  <ElaboratedType id="_378" type="_55"/>
  <Field id="_379" name="left" type="_13" context="_58" access="public" location="f4:102" file="f4" line="102" offset="0"/>
  <Field id="_380" name="top" type="_13" context="_58" access="public" location="f4:103" file="f4" line="103" offset="32"/>
  <Field id="_381" name="right" type="_13" context="_58" access="public" location="f4:104" file="f4" line="104" offset="64"/>
  <Field id="_382" name="bottom" type="_13" context="_58" access="public" location="f4:105" file="f4" line="105" offset="96"/>
  <ElaboratedType id="_383" type="_58"/>
  <Field id="_384" name="left" type="_663" context="_60" access="public" location="f4:109" file="f4" line="109" offset="0"/>
  <Field id="_385" name="top" type="_663" context="_60" access="public" location="f4:110" file="f4" line="110" offset="32"/>
  <Field id="_386" name="right" type="_663" context="_60" access="public" location="f4:111" file="f4" line="111" offset="64"/>
  <Field id="_387" name="bottom" type="_663" context="_60" access="public" location="f4:112" file="f4" line="112" offset="96"/>
  <ElaboratedType id="_388" type="_60"/>
  <Field id="_389" name="scaleX" type="_663" context="_62" access="public" location="f4:116" file="f4" line="116" offset="0"/>
  <Field id="_390" name="skewX" type="_663" context="_62" access="public" location="f4:116" file="f4" line="116" offset="32"/>
  <Field id="_391" name="transX" type="_663" context="_62" access="public" location="f4:116" file="f4" line="116" offset="64"/>
  <Field id="_392" name="skewY" type="_663" context="_62" access="public" location="f4:117" file="f4" line="117" offset="96"/>
  <Field id="_393" name="scaleY" type="_663" context="_62" access="public" location="f4:117" file="f4" line="117" offset="128"/>
  <Field id="_394" name="transY" type="_663" context="_62" access="public" location="f4:117" file="f4" line="117" offset="160"/>
  <Field id="_395" name="persp0" type="_663" context="_62" access="public" location="f4:118" file="f4" line="118" offset="192"/>
  <Field id="_396" name="persp1" type="_663" context="_62" access="public" location="f4:118" file="f4" line="118" offset="224"/>
  <Field id="_397" name="persp2" type="_663" context="_62" access="public" location="f4:118" file="f4" line="118" offset="256"/>
  <ElaboratedType id="_398" type="_62"/>
  <ElaboratedType id="_399" type="_64"/>
  <ElaboratedType id="_400" type="_66"/>
  <ElaboratedType id="_401" type="_68"/>
  <ElaboratedType id="_402" type="_70"/>
  <ElaboratedType id="_403" type="_72"/>
  <ElaboratedType id="_404" type="_74"/>
  <ElaboratedType id="_405" type="_76"/>
  <ElaboratedType id="_406" type="_78"/>
  <ElaboratedType id="_407" type="_80"/>
  <ElaboratedType id="_408" type="_82"/>
  <ElaboratedType id="_409" type="_84"/>
  <ElaboratedType id="_410" type="_86"/>
  <ElaboratedType id="_411" type="_88"/>
  <ElaboratedType id="_412" type="_90"/>
  <ElaboratedType id="_413" type="_92"/>
  <ElaboratedType id="_414" type="_94"/>
  <ElaboratedType id="_415" type="_96"/>
  <ElaboratedType id="_416" type="_98"/>
  <Field id="_417" name="x" type="_663" context="_100" access="public" location="f4:240" file="f4" line="240" offset="0"/>
  <Field id="_418" name="y" type="_663" context="_100" access="public" location="f4:241" file="f4" line="241" offset="32"/>
  <Field id="_419" name="z" type="_663" context="_100" access="public" location="f4:242" file="f4" line="242" offset="64"/>
  <ElaboratedType id="_420" type="_100"/>
  <Field id="_421" name="x" type="_13" context="_102" access="public" location="f4:246" file="f4" line="246" offset="0"/>
  <Field id="_422" name="y" type="_13" context="_102" access="public" location="f4:247" file="f4" line="247" offset="32"/>
  <ElaboratedType id="_423" type="_102"/>
  <Field id="_424" name="w" type="_663" context="_104" access="public" location="f4:251" file="f4" line="251" offset="0"/>
  <Field id="_425" name="h" type="_663" context="_104" access="public" location="f4:252" file="f4" line="252" offset="32"/>
  <ElaboratedType id="_426" type="_104"/>
  <Field id="_427" name="w" type="_13" context="_106" access="public" location="f4:256" file="f4" line="256" offset="0"/>
  <Field id="_428" name="h" type="_13" context="_106" access="public" location="f4:257" file="f4" line="257" offset="32"/>
  <ElaboratedType id="_429" type="_106"/>
  <Field id="_430" name="fFlags" type="_14" context="_108" access="public" location="f4:261" file="f4" line="261" offset="0"/>
  <Field id="_431" name="fTop" type="_663" context="_108" access="public" location="f4:262" file="f4" line="262" offset="32"/>
  <Field id="_432" name="fAscent" type="_663" context="_108" access="public" location="f4:263" file="f4" line="263" offset="64"/>
  <Field id="_433" name="fDescent" type="_663" context="_108" access="public" location="f4:264" file="f4" line="264" offset="96"/>
  <Field id="_434" name="fBottom" type="_663" context="_108" access="public" location="f4:265" file="f4" line="265" offset="128"/>
  <Field id="_435" name="fLeading" type="_663" context="_108" access="public" location="f4:266" file="f4" line="266" offset="160"/>
  <Field id="_436" name="fAvgCharWidth" type="_663" context="_108" access="public" location="f4:267" file="f4" line="267" offset="192"/>
  <Field id="_437" name="fMaxCharWidth" type="_663" context="_108" access="public" location="f4:268" file="f4" line="268" offset="224"/>
  <Field id="_438" name="fXMin" type="_663" context="_108" access="public" location="f4:269" file="f4" line="269" offset="256"/>
  <Field id="_439" name="fXMax" type="_663" context="_108" access="public" location="f4:270" file="f4" line="270" offset="288"/>
  <Field id="_440" name="fXHeight" type="_663" context="_108" access="public" location="f4:271" file="f4" line="271" offset="320"/>
  <Field id="_441" name="fCapHeight" type="_663" context="_108" access="public" location="f4:272" file="f4" line="272" offset="352"/>
  <Field id="_442" name="fUnderlineThickness" type="_663" context="_108" access="public" location="f4:273" file="f4" line="273" offset="384"/>
  <Field id="_443" name="fUnderlinePosition" type="_663" context="_108" access="public" location="f4:274" file="f4" line="274" offset="416"/>
  <Field id="_444" name="fStrikeoutThickness" type="_663" context="_108" access="public" location="f4:275" file="f4" line="275" offset="448"/>
  <Field id="_445" name="fStrikeoutPosition" type="_663" context="_108" access="public" location="f4:276" file="f4" line="276" offset="480"/>
  <ElaboratedType id="_446" type="_108"/>
  <ElaboratedType id="_447" type="_110"/>
  <ElaboratedType id="_448" type="_112"/>
  <ElaboratedType id="_449" type="_114"/>
  <ElaboratedType id="_450" type="_116"/>
  <ElaboratedType id="_451" type="_118"/>
  <ElaboratedType id="_452" type="_120"/>
  <ElaboratedType id="_453" type="_122"/>
  <ElaboratedType id="_454" type="_125"/>
  <ElaboratedType id="_455" type="_127"/>
  <ElaboratedType id="_456" type="_129"/>
  <ElaboratedType id="_457" type="_131"/>
  <ElaboratedType id="_458" type="_133"/>
  <ElaboratedType id="_459" type="_135"/>
  <ElaboratedType id="_460" type="_137"/>
  <ElaboratedType id="_461" type="_139"/>
  <ElaboratedType id="_462" type="_141"/>
  <ElaboratedType id="_463" type="_143"/>
  <ElaboratedType id="_464" type="_145"/>
  <ElaboratedType id="_465" type="_147"/>
  <ElaboratedType id="_466" type="_149"/>
  <ElaboratedType id="_467" type="_151"/>
  <ElaboratedType id="_468" type="_153"/>
  <ElaboratedType id="_469" type="_155"/>
  <ElaboratedType id="_470" type="_157"/>
  <ElaboratedType id="_471" type="_159"/>
  <ElaboratedType id="_472" type="_161"/>
  <ElaboratedType id="_473" type="_163"/>
  <ElaboratedType id="_474" type="_165"/>
  <ElaboratedType id="_475" type="_167"/>
  <ElaboratedType id="_476" type="_169"/>
  <ElaboratedType id="_477" type="_171"/>
  <ElaboratedType id="_478" type="_173"/>
  <ElaboratedType id="_479" type="_175"/>
  <ElaboratedType id="_480" type="_177"/>
  <ElaboratedType id="_481" type="_179"/>
  <ElaboratedType id="_482" type="_181"/>
  <ElaboratedType id="_483" type="_183"/>
  <ElaboratedType id="_484" type="_185"/>
  <ElaboratedType id="_485" type="_187"/>
  <Field id="_486" name="fZeroInitialized" type="_186" context="_189" access="public" location="f4:475" file="f4" line="475" offset="0"/>
  <Field id="_487" name="fSubset" type="_664" context="_189" access="public" location="f4:476" file="f4" line="476" offset="64"/>
  <Field id="_488" name="fFrameIndex" type="_360" context="_189" access="public" location="f4:477" file="f4" line="477" offset="128"/>
  <Field id="_489" name="fPriorFrame" type="_360" context="_189" access="public" location="f4:478" file="f4" line="478" offset="160"/>
  <Field id="_490" name="fPremulBehavior" type="_188" context="_189" access="public" location="f4:479" file="f4" line="479" offset="192"/>
  <ElaboratedType id="_491" type="_189"/>
  <ElaboratedType id="_492" type="_191"/>
  <ElaboratedType id="_493" type="_193"/>
  <ElaboratedType id="_494" type="_195"/>
  <ElaboratedType id="_495" type="_197"/>
  <ElaboratedType id="_496" type="_199"/>
  <ElaboratedType id="_497" type="_201"/>
  <ElaboratedType id="_498" type="_203"/>
  <ElaboratedType id="_499" type="_205"/>
  <ElaboratedType id="_500" type="_207"/>
  <ElaboratedType id="_501" type="_209"/>
  <ElaboratedType id="_502" type="_211"/>
  <ElaboratedType id="_503" type="_213"/>
  <ElaboratedType id="_504" type="_215"/>
  <ElaboratedType id="_505" type="_217"/>
  <ElaboratedType id="_506" type="_219"/>
  <ElaboratedType id="_507" type="_221"/>
  <ElaboratedType id="_508" type="_223"/>
  <ElaboratedType id="_509" type="_225"/>
  <ElaboratedType id="_510" type="_227"/>
  <ElaboratedType id="_511" type="_229"/>
  <ElaboratedType id="_512" type="_231"/>
  <ElaboratedType id="_513" type="_233"/>
  <Field id="_514" name="fImage" type="_665" context="_235" access="public" location="f4:610" file="f4" line="610" offset="0"/>
  <Field id="_515" name="fBounds" type="_59" context="_235" access="public" location="f4:611" file="f4" line="611" offset="64"/>
  <Field id="_516" name="fRowBytes" type="_14" context="_235" access="public" location="f4:612" file="f4" line="612" offset="192"/>
  <Field id="_517" name="fFormat" type="_234" context="_235" access="public" location="f4:613" file="f4" line="613" offset="224"/>
  <ElaboratedType id="_518" type="_235"/>
  <ElaboratedType id="_519" type="_238"/>
  <ElaboratedType id="_520" type="_240"/>
  <ElaboratedType id="_521" type="_242"/>
  <ElaboratedType id="_522" type="_244"/>
  <ElaboratedType id="_523" type="_247"/>
  <PointerType id="_524" type="_666" size="64" align="64"/>
  <PointerType id="_525" type="_667" size="64" align="64"/>
  <Field id="_526" name="fTarget" type="_361" context="_251" access="public" location="f4:637" file="f4" line="637" offset="0"/>
  <Field id="_527" name="fID" type="_361" context="_251" access="public" location="f4:638" file="f4" line="638" offset="32"/>
  <Field id="_528" name="fFormat" type="_361" context="_251" access="public" location="f4:639" file="f4" line="639" offset="64"/>
  <ElaboratedType id="_529" type="_251"/>
  <Field id="_530" name="fFBOID" type="_361" context="_253" access="public" location="f4:643" file="f4" line="643" offset="0"/>
  <Field id="_531" name="fFormat" type="_361" context="_253" access="public" location="f4:644" file="f4" line="644" offset="32"/>
  <ElaboratedType id="_532" type="_253"/>
  <ElaboratedType id="_533" type="_255"/>
  <ElaboratedType id="_534" type="_257"/>
  <ElaboratedType id="_535" type="_259"/>
  <ElaboratedType id="_536" type="_261"/>
  <Field id="_537" name="fXDivs" type="_668" context="_263" access="public" location="f4:670" file="f4" line="670" offset="0"/>
  <Field id="_538" name="fYDivs" type="_668" context="_263" access="public" location="f4:671" file="f4" line="671" offset="64"/>
  <Field id="_539" name="fRectTypes" type="_669" context="_263" access="public" location="f4:672" file="f4" line="672" offset="128"/>
  <Field id="_540" name="fXCount" type="_360" context="_263" access="public" location="f4:673" file="f4" line="673" offset="192"/>
  <Field id="_541" name="fYCount" type="_360" context="_263" access="public" location="f4:674" file="f4" line="674" offset="224"/>
  <Field id="_542" name="fBounds" type="_670" context="_263" access="public" location="f4:675" file="f4" line="675" offset="256"/>
  <Field id="_543" name="fColors" type="_671" context="_263" access="public" location="f4:676" file="f4" line="676" offset="320"/>
  <ElaboratedType id="_544" type="_263"/>
  <ElaboratedType id="_545" type="_265"/>
  <ElaboratedType id="_546" type="_267"/>
  <PointerType id="_547" type="_672" size="64" align="64"/>
  <PointerType id="_548" type="_673" size="64" align="64"/>
  <PointerType id="_549" type="_674" size="64" align="64"/>
  <ElaboratedType id="_550" type="_274"/>
  <ElaboratedType id="_551" type="_276"/>
  <Field id="_552" name="fTimeZoneMinutes" type="_19" context="_278" access="public" location="f4:707" file="f4" line="707" offset="0"/>
  <Field id="_553" name="fYear" type="_20" context="_278" access="public" location="f4:708" file="f4" line="708" offset="16"/>
  <Field id="_554" name="fMonth" type="_26" context="_278" access="public" location="f4:709" file="f4" line="709" offset="32"/>
  <Field id="_555" name="fDayOfWeek" type="_26" context="_278" access="public" location="f4:710" file="f4" line="710" offset="40"/>
  <Field id="_556" name="fDay" type="_26" context="_278" access="public" location="f4:711" file="f4" line="711" offset="48"/>
  <Field id="_557" name="fHour" type="_26" context="_278" access="public" location="f4:712" file="f4" line="712" offset="56"/>
  <Field id="_558" name="fMinute" type="_26" context="_278" access="public" location="f4:713" file="f4" line="713" offset="64"/>
  <Field id="_559" name="fSecond" type="_26" context="_278" access="public" location="f4:714" file="f4" line="714" offset="72"/>
  <ElaboratedType id="_560" type="_278"/>
  <Field id="_561" name="fTitle" type="_675" context="_280" access="public" location="f4:718" file="f4" line="718" offset="0"/>
  <Field id="_562" name="fAuthor" type="_675" context="_280" access="public" location="f4:719" file="f4" line="719" offset="64"/>
  <Field id="_563" name="fSubject" type="_675" context="_280" access="public" location="f4:720" file="f4" line="720" offset="128"/>
  <Field id="_564" name="fKeywords" type="_675" context="_280" access="public" location="f4:721" file="f4" line="721" offset="192"/>
  <Field id="_565" name="fCreator" type="_675" context="_280" access="public" location="f4:722" file="f4" line="722" offset="256"/>
  <Field id="_566" name="fProducer" type="_675" context="_280" access="public" location="f4:723" file="f4" line="723" offset="320"/>
  <Field id="_567" name="fCreation" type="_676" context="_280" access="public" location="f4:724" file="f4" line="724" offset="384"/>
  <Field id="_568" name="fModified" type="_676" context="_280" access="public" location="f4:725" file="f4" line="725" offset="448"/>
  <Field id="_569" name="fRasterDPI" type="_663" context="_280" access="public" location="f4:726" file="f4" line="726" offset="512"/>
  <Field id="_570" name="fPDFA" type="_651" context="_280" access="public" location="f4:727" file="f4" line="727" offset="544"/>
  <Field id="_571" name="fEncodingQuality" type="_360" context="_280" access="public" location="f4:728" file="f4" line="728" offset="576"/>
  <ElaboratedType id="_572" type="_280"/>
  <Field id="_573" name="colorspace" type="_677" context="_282" access="public" location="f4:732" file="f4" line="732" offset="0"/>
  <Field id="_574" name="width" type="_13" context="_282" access="public" location="f4:733" file="f4" line="733" offset="64"/>
  <Field id="_575" name="height" type="_13" context="_282" access="public" location="f4:734" file="f4" line="734" offset="96"/>
  <Field id="_576" name="colorType" type="_46" context="_282" access="public" location="f4:735" file="f4" line="735" offset="128"/>
  <Field id="_577" name="alphaType" type="_48" context="_282" access="public" location="f4:736" file="f4" line="736" offset="160"/>
  <ElaboratedType id="_578" type="_282"/>
  <ElaboratedType id="_579" type="_284"/>
  <Field id="_580" name="fRequiredFrame" type="_360" context="_286" access="public" location="f4:746" file="f4" line="746" offset="0"/>
  <Field id="_581" name="fDuration" type="_360" context="_286" access="public" location="f4:747" file="f4" line="747" offset="32"/>
  <Field id="_582" name="fFullyReceived" type="_651" context="_286" access="public" location="f4:748" file="f4" line="748" offset="64"/>
  <Field id="_583" name="fAlphaType" type="_48" context="_286" access="public" location="f4:749" file="f4" line="749" offset="96"/>
  <Field id="_584" name="fDisposalMethod" type="_285" context="_286" access="public" location="f4:750" file="f4" line="750" offset="128"/>
  <ElaboratedType id="_585" type="_286"/>
  <ElaboratedType id="_586" type="_288"/>
  <ElaboratedType id="_587" type="_290"/>
  <ElaboratedType id="_588" type="_292"/>
  <ElaboratedType id="_589" type="_294"/>
  <ElaboratedType id="_590" type="_296"/>
  <ElaboratedType id="_591" type="_298"/>
  <ElaboratedType id="_592" type="_300"/>
  <ElaboratedType id="_593" type="_302"/>
  <ElaboratedType id="_594" type="_304"/>
  <ElaboratedType id="_595" type="_306"/>
  <Field id="_596" name="fG" type="_663" context="_308" access="public" location="f4:794" file="f4" line="794" offset="0"/>
  <Field id="_597" name="fA" type="_663" context="_308" access="public" location="f4:795" file="f4" line="795" offset="32"/>
  <Field id="_598" name="fB" type="_663" context="_308" access="public" location="f4:796" file="f4" line="796" offset="64"/>
  <Field id="_599" name="fC" type="_663" context="_308" access="public" location="f4:797" file="f4" line="797" offset="96"/>
  <Field id="_600" name="fD" type="_663" context="_308" access="public" location="f4:798" file="f4" line="798" offset="128"/>
  <Field id="_601" name="fE" type="_663" context="_308" access="public" location="f4:799" file="f4" line="799" offset="160"/>
  <Field id="_602" name="fF" type="_663" context="_308" access="public" location="f4:800" file="f4" line="800" offset="192"/>
  <ElaboratedType id="_603" type="_308"/>
  <Field id="_604" name="fRX" type="_663" context="_310" access="public" location="f4:804" file="f4" line="804" offset="0"/>
  <Field id="_605" name="fRY" type="_663" context="_310" access="public" location="f4:805" file="f4" line="805" offset="32"/>
  <Field id="_606" name="fGX" type="_663" context="_310" access="public" location="f4:806" file="f4" line="806" offset="64"/>
  <Field id="_607" name="fGY" type="_663" context="_310" access="public" location="f4:807" file="f4" line="807" offset="96"/>
  <Field id="_608" name="fBX" type="_663" context="_310" access="public" location="f4:808" file="f4" line="808" offset="128"/>
  <Field id="_609" name="fBY" type="_663" context="_310" access="public" location="f4:809" file="f4" line="809" offset="160"/>
  <Field id="_610" name="fWX" type="_663" context="_310" access="public" location="f4:810" file="f4" line="810" offset="192"/>
  <Field id="_611" name="fWY" type="_663" context="_310" access="public" location="f4:811" file="f4" line="811" offset="224"/>
  <ElaboratedType id="_612" type="_310"/>
  <ElaboratedType id="_613" type="_312"/>
  <Field id="_614" name="fGrayscale" type="_651" context="_314" access="public" location="f4:821" file="f4" line="821" offset="0"/>
  <Field id="_615" name="fInvertStyle" type="_313" context="_314" access="public" location="f4:822" file="f4" line="822" offset="32"/>
  <Field id="_616" name="fContrast" type="_663" context="_314" access="public" location="f4:823" file="f4" line="823" offset="64"/>
  <ElaboratedType id="_617" type="_314"/>
  <ElaboratedType id="_618" type="_316"/>
  <Field id="_619" name="fFilterFlags" type="_317" context="_318" access="public" location="f4:841" file="f4" line="841" offset="0"/>
  <Field id="_620" name="fZLibLevel" type="_360" context="_318" access="public" location="f4:842" file="f4" line="842" offset="32"/>
  <Field id="_621" name="fUnpremulBehavior" type="_188" context="_318" access="public" location="f4:843" file="f4" line="843" offset="64"/>
  <Field id="_622" name="fComments" type="_678" context="_318" access="public" location="f4:844" file="f4" line="844" offset="128"/>
  <ElaboratedType id="_623" type="_318"/>
  <ElaboratedType id="_624" type="_320"/>
  <ElaboratedType id="_625" type="_322"/>
  <Field id="_626" name="fQuality" type="_360" context="_324" access="public" location="f4:859" file="f4" line="859" offset="0"/>
  <Field id="_627" name="fDownsample" type="_321" context="_324" access="public" location="f4:860" file="f4" line="860" offset="32"/>
  <Field id="_628" name="fAlphaOption" type="_323" context="_324" access="public" location="f4:861" file="f4" line="861" offset="64"/>
  <Field id="_629" name="fBlendBehavior" type="_188" context="_324" access="public" location="f4:862" file="f4" line="862" offset="96"/>
  <ElaboratedType id="_630" type="_324"/>
  <ElaboratedType id="_631" type="_326"/>
  <Field id="_632" name="fCompression" type="_327" context="_328" access="public" location="f4:871" file="f4" line="871" offset="0"/>
  <Field id="_633" name="fQuality" type="_663" context="_328" access="public" location="f4:872" file="f4" line="872" offset="32"/>
  <Field id="_634" name="fUnpremulBehavior" type="_188" context="_328" access="public" location="f4:873" file="f4" line="873" offset="64"/>
  <ElaboratedType id="_635" type="_328"/>
  <ElaboratedType id="_636" type="_330"/>
  <ElaboratedType id="_637" type="_332"/>
  <ElaboratedType id="_638" type="_334"/>
  <ElaboratedType id="_639" type="_336"/>
  <ElaboratedType id="_640" type="_338"/>
  <Field id="_641" name="glyphs" type="_678" context="_340" access="public" location="f4:897" file="f4" line="897" offset="0"/>
  <Field id="_642" name="pos" type="_678" context="_340" access="public" location="f4:898" file="f4" line="898" offset="64"/>
  <Field id="_643" name="utf8text" type="_678" context="_340" access="public" location="f4:899" file="f4" line="899" offset="128"/>
  <Field id="_644" name="clusters" type="_678" context="_340" access="public" location="f4:900" file="f4" line="900" offset="192"/>
  <ElaboratedType id="_645" type="_340"/>
  <Field id="_646" name="fSCos" type="_663" context="_342" access="public" location="f4:904" file="f4" line="904" offset="0"/>
  <Field id="_647" name="fSSin" type="_663" context="_342" access="public" location="f4:905" file="f4" line="905" offset="32"/>
  <Field id="_648" name="fTX" type="_663" context="_342" access="public" location="f4:906" file="f4" line="906" offset="64"/>
  <Field id="_649" name="fTY" type="_663" context="_342" access="public" location="f4:907" file="f4" line="907" offset="96"/>
  <ElaboratedType id="_650" type="_342"/>
  <FundamentalType id="_651" name="_Bool" size="8" align="8"/>
  <PointerType id="_652" type="_40c" size="64" align="64"/>
  <CvQualifiedType id="_40c" type="_40" const="1"/>
  <FundamentalType id="_653" name="void" size="0" align="8"/>
  <PointerType id="_654" type="_40" size="64" align="64"/>
  <PointerType id="_655" type="_42c" size="64" align="64"/>
  <CvQualifiedType id="_42c" type="_42" const="1"/>
  <PointerType id="_656" type="_42" size="64" align="64"/>
  <Field id="_657" name="isa" type="_668" context="_355" access="public" offset="0"/>
  <Field id="_658" name="flags" type="_360" context="_355" access="public" offset="64"/>
  <Field id="_659" name="str" type="_679" context="_355" access="public" offset="128"/>
  <Field id="_660" name="length" type="_366" context="_355" access="public" offset="192"/>
  <Struct id="_662" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_680 _681 _682 _683" size="192" align="64"/>
  <FundamentalType id="_663" name="float" size="32" align="32"/>
  <PointerType id="_664" type="_59" size="64" align="64"/>
  <PointerType id="_665" type="_26" size="64" align="64"/>
  <PointerType id="_668" type="_360c" size="64" align="64"/>
  <CvQualifiedType id="_360c" type="_360" const="1"/>
  <PointerType id="_669" type="_262c" size="64" align="64"/>
  <CvQualifiedType id="_262c" type="_262" const="1"/>
  <PointerType id="_670" type="_59c" size="64" align="64"/>
  <CvQualifiedType id="_59c" type="_59" const="1"/>
  <PointerType id="_671" type="_43c" size="64" align="64"/>
  <CvQualifiedType id="_43c" type="_43" const="1"/>
  <PointerType id="_675" type="_111" size="64" align="64"/>
  <PointerType id="_676" type="_279" size="64" align="64"/>
  <PointerType id="_677" type="_134" size="64" align="64"/>
  <PointerType id="_678" type="_653" size="64" align="64"/>
  <PointerType id="_679" type="_661c" size="64" align="64"/>
  <CvQualifiedType id="_661c" type="_661" const="1"/>
  <Field id="_680" name="gp_offset" type="_361" context="_662" access="public" offset="0"/>
  <Field id="_681" name="fp_offset" type="_361" context="_662" access="public" offset="32"/>
  <Field id="_682" name="overflow_arg_area" type="_678" context="_662" access="public" offset="64"/>
  <Field id="_683" name="reg_save_area" type="_678" context="_662" access="public" offset="128"/>
  <FundamentalType id="_661" name="char" size="8" align="8"/>
  <FunctionType id="_666" returns="_653"/>
  <FunctionType id="_667" returns="_249">
    <Argument type="_678"/>
    <Argument type="_679"/>
  </FunctionType>
  <FunctionType id="_672" returns="_653">
    <Argument type="_678"/>
    <Argument type="_678"/>
  </FunctionType>
  <FunctionType id="_673" returns="_653">
    <Argument type="_684"/>
    <Argument type="_678"/>
  </FunctionType>
  <FunctionType id="_674" returns="_653">
    <Argument type="_678"/>
  </FunctionType>
  <PointerType id="_684" type="_653c" size="64" align="64"/>
  <CvQualifiedType id="_653c" type="_653" const="1"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="/usr/local/Cellar/castxml/0.2.0/share/castxml/clang/include/stdint.h"/>
  <File id="f2" name="/usr/local/Cellar/castxml/0.2.0/share/castxml/clang/include/stddef.h"/>
  <File id="f3" name="/usr/local/Cellar/castxml/0.2.0/share/castxml/clang/include/__stddef_max_align_t.h"/>
  <File id="f4" name="./c/sk_types.h"/>
  <File id="f5" name="./c/sk_general.h"/>
</CastXML>
