<?xml version="1.0"?>
<CastXML format="1.1.5">

  <Function id="_367" name="sk_imagefilter_new_erode" returns="_679" context="_1" location="f5:135" file="f5" line="135" mangled="_Z24sk_imagefilter_new_erode">
    <Argument name="radiusX" type="_384" location="f5:136" file="f5" line="136"/>
    <Argument name="radiusY" type="_384" location="f5:137" file="f5" line="137"/>
    <Argument name="input" type="_679" location="f5:138" file="f5" line="138"/>
    <Argument name="cropRect" type="_683" location="f5:139" file="f5" line="139"/>
  </Function>
  <Function id="_368" name="sk_imagefilter_new_offset" returns="_679" context="_1" location="f5:140" file="f5" line="140" mangled="_Z25sk_imagefilter_new_offset">
    <Argument name="dx" type="_682" location="f5:141" file="f5" line="141"/>
    <Argument name="dy" type="_682" location="f5:142" file="f5" line="142"/>
    <Argument name="input" type="_679" location="f5:143" file="f5" line="143"/>
    <Argument name="cropRect" type="_683" location="f5:144" file="f5" line="144"/>
  </Function>
  <Function id="_369" name="sk_imagefilter_new_picture" returns="_679" context="_1" location="f5:145" file="f5" line="145" mangled="_Z26sk_imagefilter_new_picture">
    <Argument name="picture" type="_693" location="f5:146" file="f5" line="146"/>
  </Function>
  <Function id="_370" name="sk_imagefilter_new_picture_with_croprect" returns="_679" context="_1" location="f5:147" file="f5" line="147" mangled="_Z40sk_imagefilter_new_picture_with_croprect">
    <Argument name="picture" type="_693" location="f5:148" file="f5" line="148"/>
    <Argument name="cropRect" type="_676" location="f5:149" file="f5" line="149"/>
  </Function>
  <Function id="_371" name="sk_imagefilter_new_tile" returns="_679" context="_1" location="f5:150" file="f5" line="150" mangled="_Z23sk_imagefilter_new_tile">
    <Argument name="src" type="_676" location="f5:151" file="f5" line="151"/>
    <Argument name="dst" type="_676" location="f5:152" file="f5" line="152"/>
    <Argument name="input" type="_679" location="f5:153" file="f5" line="153"/>
  </Function>
  <Function id="_372" name="sk_imagefilter_new_xfermode" returns="_679" context="_1" location="f5:154" file="f5" line="154" mangled="_Z27sk_imagefilter_new_xfermode">
    <Argument name="mode" type="_99" location="f5:155" file="f5" line="155"/>
    <Argument name="background" type="_679" location="f5:156" file="f5" line="156"/>
    <Argument name="foreground" type="_679" location="f5:157" file="f5" line="157"/>
    <Argument name="cropRect" type="_683" location="f5:158" file="f5" line="158"/>
  </Function>
  <Function id="_373" name="sk_imagefilter_new_arithmetic" returns="_679" context="_1" location="f5:159" file="f5" line="159" mangled="_Z29sk_imagefilter_new_arithmetic">
    <Argument name="k1" type="_682" location="f5:160" file="f5" line="160"/>
    <Argument name="k2" type="_682" location="f5:160" file="f5" line="160"/>
    <Argument name="k3" type="_682" location="f5:160" file="f5" line="160"/>
    <Argument name="k4" type="_682" location="f5:160" file="f5" line="160"/>
    <Argument name="enforcePMColor" type="_690" location="f5:161" file="f5" line="161"/>
    <Argument name="background" type="_679" location="f5:162" file="f5" line="162"/>
    <Argument name="foreground" type="_679" location="f5:163" file="f5" line="163"/>
    <Argument name="cropRect" type="_683" location="f5:164" file="f5" line="164"/>
  </Function>
  <Function id="_374" name="sk_imagefilter_new_image_source" returns="_679" context="_1" location="f5:165" file="f5" line="165" mangled="_Z31sk_imagefilter_new_image_source">
    <Argument name="image" type="_694" location="f5:166" file="f5" line="166"/>
    <Argument name="srcRect" type="_676" location="f5:167" file="f5" line="167"/>
    <Argument name="dstRect" type="_676" location="f5:168" file="f5" line="168"/>
    <Argument name="filterQuality" type="_166" location="f5:169" file="f5" line="169"/>
  </Function>
  <Function id="_375" name="sk_imagefilter_new_image_source_default" returns="_679" context="_1" location="f5:170" file="f5" line="170" mangled="_Z39sk_imagefilter_new_image_source_default">
    <Argument name="image" type="_694" location="f5:171" file="f5" line="171"/>
  </Function>
  <Function id="_376" name="sk_imagefilter_new_paint" returns="_679" context="_1" location="f5:172" file="f5" line="172" mangled="_Z24sk_imagefilter_new_paint">
    <Argument name="paint" type="_695" location="f5:173" file="f5" line="173"/>
    <Argument name="cropRect" type="_683" location="f5:174" file="f5" line="174"/>
  </Function>
  <FundamentalType id="_377" name="__int128" size="128" align="128"/>
  <FundamentalType id="_378" name="unsigned __int128" size="128" align="128"/>
  <Struct id="_379" name="__NSConstantString_tag" context="_1" location="f0:0" file="f0" line="0" members="_696 _697 _698 _699" size="256" align="64"/>
  <PointerType id="_380" type="_700" size="64" align="64"/>
  <ArrayType id="_381" min="0" max="0" type="_701"/>
  <FundamentalType id="_382" name="long long int" size="64" align="64"/>
  <FundamentalType id="_383" name="long long unsigned int" size="64" align="64"/>
  <FundamentalType id="_384" name="int" size="32" align="32"/>
  <FundamentalType id="_385" name="unsigned int" size="32" align="32"/>
  <FundamentalType id="_386" name="short int" size="16" align="16"/>
  <FundamentalType id="_387" name="short unsigned int" size="16" align="16"/>
  <FundamentalType id="_388" name="signed char" size="8" align="8"/>
  <FundamentalType id="_389" name="unsigned char" size="8" align="8"/>
  <FundamentalType id="_390" name="long int" size="64" align="64"/>
  <FundamentalType id="_391" name="long unsigned int" size="64" align="64"/>
  <FundamentalType id="_392" name="long double" size="128" align="128"/>
  <ElaboratedType id="_393" type="_39"/>
  <ElaboratedType id="_394" type="_41"/>
  <ElaboratedType id="_395" type="_45"/>
  <ElaboratedType id="_396" type="_47"/>
  <ElaboratedType id="_397" type="_49"/>
  <ElaboratedType id="_398" type="_51"/>
  <ElaboratedType id="_399" type="_53"/>
  <Field id="_400" name="x" type="_682" context="_55" access="public" location="f4:95" file="f4" line="95" offset="0"/>
  <Field id="_401" name="y" type="_682" context="_55" access="public" location="f4:96" file="f4" line="96" offset="32"/>
  <ElaboratedType id="_402" type="_55"/>
  <Field id="_403" name="left" type="_13" context="_58" access="public" location="f4:102" file="f4" line="102" offset="0"/>
  <Field id="_404" name="top" type="_13" context="_58" access="public" location="f4:103" file="f4" line="103" offset="32"/>
  <Field id="_405" name="right" type="_13" context="_58" access="public" location="f4:104" file="f4" line="104" offset="64"/>
  <Field id="_406" name="bottom" type="_13" context="_58" access="public" location="f4:105" file="f4" line="105" offset="96"/>
  <ElaboratedType id="_407" type="_58"/>
  <Field id="_408" name="left" type="_682" context="_60" access="public" location="f4:109" file="f4" line="109" offset="0"/>
  <Field id="_409" name="top" type="_682" context="_60" access="public" location="f4:110" file="f4" line="110" offset="32"/>
  <Field id="_410" name="right" type="_682" context="_60" access="public" location="f4:111" file="f4" line="111" offset="64"/>
  <Field id="_411" name="bottom" type="_682" context="_60" access="public" location="f4:112" file="f4" line="112" offset="96"/>
  <ElaboratedType id="_412" type="_60"/>
  <Field id="_413" name="scaleX" type="_682" context="_62" access="public" location="f4:116" file="f4" line="116" offset="0"/>
  <Field id="_414" name="skewX" type="_682" context="_62" access="public" location="f4:116" file="f4" line="116" offset="32"/>
  <Field id="_415" name="transX" type="_682" context="_62" access="public" location="f4:116" file="f4" line="116" offset="64"/>
  <Field id="_416" name="skewY" type="_682" context="_62" access="public" location="f4:117" file="f4" line="117" offset="96"/>
  <Field id="_417" name="scaleY" type="_682" context="_62" access="public" location="f4:117" file="f4" line="117" offset="128"/>
  <Field id="_418" name="transY" type="_682" context="_62" access="public" location="f4:117" file="f4" line="117" offset="160"/>
  <Field id="_419" name="persp0" type="_682" context="_62" access="public" location="f4:118" file="f4" line="118" offset="192"/>
  <Field id="_420" name="persp1" type="_682" context="_62" access="public" location="f4:118" file="f4" line="118" offset="224"/>
  <Field id="_421" name="persp2" type="_682" context="_62" access="public" location="f4:118" file="f4" line="118" offset="256"/>
  <ElaboratedType id="_422" type="_62"/>
  <ElaboratedType id="_423" type="_64"/>
  <ElaboratedType id="_424" type="_66"/>
  <ElaboratedType id="_425" type="_68"/>
  <ElaboratedType id="_426" type="_70"/>
  <ElaboratedType id="_427" type="_72"/>
  <ElaboratedType id="_428" type="_74"/>
  <ElaboratedType id="_429" type="_76"/>
  <ElaboratedType id="_430" type="_78"/>
  <ElaboratedType id="_431" type="_80"/>
  <ElaboratedType id="_432" type="_82"/>
  <ElaboratedType id="_433" type="_84"/>
  <ElaboratedType id="_434" type="_86"/>
  <ElaboratedType id="_435" type="_88"/>
  <ElaboratedType id="_436" type="_90"/>
  <ElaboratedType id="_437" type="_92"/>
  <ElaboratedType id="_438" type="_94"/>
  <ElaboratedType id="_439" type="_96"/>
  <ElaboratedType id="_440" type="_98"/>
  <Field id="_441" name="x" type="_682" context="_100" access="public" location="f4:240" file="f4" line="240" offset="0"/>
  <Field id="_442" name="y" type="_682" context="_100" access="public" location="f4:241" file="f4" line="241" offset="32"/>
  <Field id="_443" name="z" type="_682" context="_100" access="public" location="f4:242" file="f4" line="242" offset="64"/>
  <ElaboratedType id="_444" type="_100"/>
  <Field id="_445" name="x" type="_13" context="_102" access="public" location="f4:246" file="f4" line="246" offset="0"/>
  <Field id="_446" name="y" type="_13" context="_102" access="public" location="f4:247" file="f4" line="247" offset="32"/>
  <ElaboratedType id="_447" type="_102"/>
  <Field id="_448" name="w" type="_682" context="_104" access="public" location="f4:251" file="f4" line="251" offset="0"/>
  <Field id="_449" name="h" type="_682" context="_104" access="public" location="f4:252" file="f4" line="252" offset="32"/>
  <ElaboratedType id="_450" type="_104"/>
  <Field id="_451" name="w" type="_13" context="_106" access="public" location="f4:256" file="f4" line="256" offset="0"/>
  <Field id="_452" name="h" type="_13" context="_106" access="public" location="f4:257" file="f4" line="257" offset="32"/>
  <ElaboratedType id="_453" type="_106"/>
  <Field id="_454" name="fFlags" type="_14" context="_108" access="public" location="f4:261" file="f4" line="261" offset="0"/>
  <Field id="_455" name="fTop" type="_682" context="_108" access="public" location="f4:262" file="f4" line="262" offset="32"/>
  <Field id="_456" name="fAscent" type="_682" context="_108" access="public" location="f4:263" file="f4" line="263" offset="64"/>
  <Field id="_457" name="fDescent" type="_682" context="_108" access="public" location="f4:264" file="f4" line="264" offset="96"/>
  <Field id="_458" name="fBottom" type="_682" context="_108" access="public" location="f4:265" file="f4" line="265" offset="128"/>
  <Field id="_459" name="fLeading" type="_682" context="_108" access="public" location="f4:266" file="f4" line="266" offset="160"/>
  <Field id="_460" name="fAvgCharWidth" type="_682" context="_108" access="public" location="f4:267" file="f4" line="267" offset="192"/>
  <Field id="_461" name="fMaxCharWidth" type="_682" context="_108" access="public" location="f4:268" file="f4" line="268" offset="224"/>
  <Field id="_462" name="fXMin" type="_682" context="_108" access="public" location="f4:269" file="f4" line="269" offset="256"/>
  <Field id="_463" name="fXMax" type="_682" context="_108" access="public" location="f4:270" file="f4" line="270" offset="288"/>
  <Field id="_464" name="fXHeight" type="_682" context="_108" access="public" location="f4:271" file="f4" line="271" offset="320"/>
  <Field id="_465" name="fCapHeight" type="_682" context="_108" access="public" location="f4:272" file="f4" line="272" offset="352"/>
  <Field id="_466" name="fUnderlineThickness" type="_682" context="_108" access="public" location="f4:273" file="f4" line="273" offset="384"/>
  <Field id="_467" name="fUnderlinePosition" type="_682" context="_108" access="public" location="f4:274" file="f4" line="274" offset="416"/>
  <Field id="_468" name="fStrikeoutThickness" type="_682" context="_108" access="public" location="f4:275" file="f4" line="275" offset="448"/>
  <Field id="_469" name="fStrikeoutPosition" type="_682" context="_108" access="public" location="f4:276" file="f4" line="276" offset="480"/>
  <ElaboratedType id="_470" type="_108"/>
  <ElaboratedType id="_471" type="_110"/>
  <ElaboratedType id="_472" type="_112"/>
  <ElaboratedType id="_473" type="_114"/>
  <ElaboratedType id="_474" type="_116"/>
  <ElaboratedType id="_475" type="_118"/>
  <ElaboratedType id="_476" type="_120"/>
  <ElaboratedType id="_477" type="_122"/>
  <ElaboratedType id="_478" type="_125"/>
  <ElaboratedType id="_479" type="_127"/>
  <ElaboratedType id="_480" type="_129"/>
  <ElaboratedType id="_481" type="_131"/>
  <ElaboratedType id="_482" type="_133"/>
  <ElaboratedType id="_483" type="_135"/>
  <ElaboratedType id="_484" type="_137"/>
  <ElaboratedType id="_485" type="_139"/>
  <ElaboratedType id="_486" type="_141"/>
  <ElaboratedType id="_487" type="_143"/>
  <ElaboratedType id="_488" type="_145"/>
  <ElaboratedType id="_489" type="_147"/>
  <ElaboratedType id="_490" type="_149"/>
  <ElaboratedType id="_491" type="_151"/>
  <ElaboratedType id="_492" type="_153"/>
  <ElaboratedType id="_493" type="_155"/>
  <ElaboratedType id="_494" type="_157"/>
  <ElaboratedType id="_495" type="_159"/>
  <ElaboratedType id="_496" type="_161"/>
  <ElaboratedType id="_497" type="_163"/>
  <ElaboratedType id="_498" type="_165"/>
  <ElaboratedType id="_499" type="_167"/>
  <ElaboratedType id="_500" type="_169"/>
  <ElaboratedType id="_501" type="_171"/>
  <ElaboratedType id="_502" type="_173"/>
  <ElaboratedType id="_503" type="_175"/>
  <ElaboratedType id="_504" type="_177"/>
  <ElaboratedType id="_505" type="_179"/>
  <ElaboratedType id="_506" type="_181"/>
  <ElaboratedType id="_507" type="_183"/>
  <ElaboratedType id="_508" type="_185"/>
  <ElaboratedType id="_509" type="_187"/>
  <Field id="_510" name="fZeroInitialized" type="_186" context="_189" access="public" location="f4:475" file="f4" line="475" offset="0"/>
  <Field id="_511" name="fSubset" type="_702" context="_189" access="public" location="f4:476" file="f4" line="476" offset="64"/>
  <Field id="_512" name="fFrameIndex" type="_384" context="_189" access="public" location="f4:477" file="f4" line="477" offset="128"/>
  <Field id="_513" name="fPriorFrame" type="_384" context="_189" access="public" location="f4:478" file="f4" line="478" offset="160"/>
  <Field id="_514" name="fPremulBehavior" type="_188" context="_189" access="public" location="f4:479" file="f4" line="479" offset="192"/>
  <ElaboratedType id="_515" type="_189"/>
  <ElaboratedType id="_516" type="_191"/>
  <ElaboratedType id="_517" type="_193"/>
  <ElaboratedType id="_518" type="_195"/>
  <ElaboratedType id="_519" type="_197"/>
  <ElaboratedType id="_520" type="_199"/>
  <ElaboratedType id="_521" type="_201"/>
  <ElaboratedType id="_522" type="_203"/>
  <ElaboratedType id="_523" type="_205"/>
  <ElaboratedType id="_524" type="_207"/>
  <ElaboratedType id="_525" type="_209"/>
  <ElaboratedType id="_526" type="_211"/>
  <ElaboratedType id="_527" type="_213"/>
  <ElaboratedType id="_528" type="_215"/>
  <ElaboratedType id="_529" type="_217"/>
  <ElaboratedType id="_530" type="_219"/>
  <ElaboratedType id="_531" type="_221"/>
  <ElaboratedType id="_532" type="_223"/>
  <ElaboratedType id="_533" type="_225"/>
  <ElaboratedType id="_534" type="_227"/>
  <ElaboratedType id="_535" type="_229"/>
  <ElaboratedType id="_536" type="_231"/>
  <ElaboratedType id="_537" type="_233"/>
  <Field id="_538" name="fImage" type="_703" context="_235" access="public" location="f4:610" file="f4" line="610" offset="0"/>
  <Field id="_539" name="fBounds" type="_59" context="_235" access="public" location="f4:611" file="f4" line="611" offset="64"/>
  <Field id="_540" name="fRowBytes" type="_14" context="_235" access="public" location="f4:612" file="f4" line="612" offset="192"/>
  <Field id="_541" name="fFormat" type="_234" context="_235" access="public" location="f4:613" file="f4" line="613" offset="224"/>
  <ElaboratedType id="_542" type="_235"/>
  <ElaboratedType id="_543" type="_238"/>
  <ElaboratedType id="_544" type="_240"/>
  <ElaboratedType id="_545" type="_242"/>
  <ElaboratedType id="_546" type="_244"/>
  <ElaboratedType id="_547" type="_247"/>
  <PointerType id="_548" type="_704" size="64" align="64"/>
  <PointerType id="_549" type="_705" size="64" align="64"/>
  <Field id="_550" name="fTarget" type="_385" context="_251" access="public" location="f4:637" file="f4" line="637" offset="0"/>
  <Field id="_551" name="fID" type="_385" context="_251" access="public" location="f4:638" file="f4" line="638" offset="32"/>
  <Field id="_552" name="fFormat" type="_385" context="_251" access="public" location="f4:639" file="f4" line="639" offset="64"/>
  <ElaboratedType id="_553" type="_251"/>
  <Field id="_554" name="fFBOID" type="_385" context="_253" access="public" location="f4:643" file="f4" line="643" offset="0"/>
  <Field id="_555" name="fFormat" type="_385" context="_253" access="public" location="f4:644" file="f4" line="644" offset="32"/>
  <ElaboratedType id="_556" type="_253"/>
  <ElaboratedType id="_557" type="_255"/>
  <ElaboratedType id="_558" type="_257"/>
  <ElaboratedType id="_559" type="_259"/>
  <ElaboratedType id="_560" type="_261"/>
  <Field id="_561" name="fXDivs" type="_706" context="_263" access="public" location="f4:670" file="f4" line="670" offset="0"/>
  <Field id="_562" name="fYDivs" type="_706" context="_263" access="public" location="f4:671" file="f4" line="671" offset="64"/>
  <Field id="_563" name="fRectTypes" type="_707" context="_263" access="public" location="f4:672" file="f4" line="672" offset="128"/>
  <Field id="_564" name="fXCount" type="_384" context="_263" access="public" location="f4:673" file="f4" line="673" offset="192"/>
  <Field id="_565" name="fYCount" type="_384" context="_263" access="public" location="f4:674" file="f4" line="674" offset="224"/>
  <Field id="_566" name="fBounds" type="_708" context="_263" access="public" location="f4:675" file="f4" line="675" offset="256"/>
  <Field id="_567" name="fColors" type="_709" context="_263" access="public" location="f4:676" file="f4" line="676" offset="320"/>
  <ElaboratedType id="_568" type="_263"/>
  <ElaboratedType id="_569" type="_265"/>
  <ElaboratedType id="_570" type="_267"/>
  <PointerType id="_571" type="_710" size="64" align="64"/>
  <PointerType id="_572" type="_711" size="64" align="64"/>
  <PointerType id="_573" type="_712" size="64" align="64"/>
  <ElaboratedType id="_574" type="_274"/>
  <ElaboratedType id="_575" type="_276"/>
  <Field id="_576" name="fTimeZoneMinutes" type="_19" context="_278" access="public" location="f4:707" file="f4" line="707" offset="0"/>
  <Field id="_577" name="fYear" type="_20" context="_278" access="public" location="f4:708" file="f4" line="708" offset="16"/>
  <Field id="_578" name="fMonth" type="_26" context="_278" access="public" location="f4:709" file="f4" line="709" offset="32"/>
  <Field id="_579" name="fDayOfWeek" type="_26" context="_278" access="public" location="f4:710" file="f4" line="710" offset="40"/>
  <Field id="_580" name="fDay" type="_26" context="_278" access="public" location="f4:711" file="f4" line="711" offset="48"/>
  <Field id="_581" name="fHour" type="_26" context="_278" access="public" location="f4:712" file="f4" line="712" offset="56"/>
  <Field id="_582" name="fMinute" type="_26" context="_278" access="public" location="f4:713" file="f4" line="713" offset="64"/>
  <Field id="_583" name="fSecond" type="_26" context="_278" access="public" location="f4:714" file="f4" line="714" offset="72"/>
  <ElaboratedType id="_584" type="_278"/>
  <Field id="_585" name="fTitle" type="_713" context="_280" access="public" location="f4:718" file="f4" line="718" offset="0"/>
  <Field id="_586" name="fAuthor" type="_713" context="_280" access="public" location="f4:719" file="f4" line="719" offset="64"/>
  <Field id="_587" name="fSubject" type="_713" context="_280" access="public" location="f4:720" file="f4" line="720" offset="128"/>
  <Field id="_588" name="fKeywords" type="_713" context="_280" access="public" location="f4:721" file="f4" line="721" offset="192"/>
  <Field id="_589" name="fCreator" type="_713" context="_280" access="public" location="f4:722" file="f4" line="722" offset="256"/>
  <Field id="_590" name="fProducer" type="_713" context="_280" access="public" location="f4:723" file="f4" line="723" offset="320"/>
  <Field id="_591" name="fCreation" type="_714" context="_280" access="public" location="f4:724" file="f4" line="724" offset="384"/>
  <Field id="_592" name="fModified" type="_714" context="_280" access="public" location="f4:725" file="f4" line="725" offset="448"/>
  <Field id="_593" name="fRasterDPI" type="_682" context="_280" access="public" location="f4:726" file="f4" line="726" offset="512"/>
  <Field id="_594" name="fPDFA" type="_690" context="_280" access="public" location="f4:727" file="f4" line="727" offset="544"/>
  <Field id="_595" name="fEncodingQuality" type="_384" context="_280" access="public" location="f4:728" file="f4" line="728" offset="576"/>
  <ElaboratedType id="_596" type="_280"/>
  <Field id="_597" name="colorspace" type="_715" context="_282" access="public" location="f4:732" file="f4" line="732" offset="0"/>
  <Field id="_598" name="width" type="_13" context="_282" access="public" location="f4:733" file="f4" line="733" offset="64"/>
  <Field id="_599" name="height" type="_13" context="_282" access="public" location="f4:734" file="f4" line="734" offset="96"/>
  <Field id="_600" name="colorType" type="_46" context="_282" access="public" location="f4:735" file="f4" line="735" offset="128"/>
  <Field id="_601" name="alphaType" type="_48" context="_282" access="public" location="f4:736" file="f4" line="736" offset="160"/>
  <ElaboratedType id="_602" type="_282"/>
  <ElaboratedType id="_603" type="_284"/>
  <Field id="_604" name="fRequiredFrame" type="_384" context="_286" access="public" location="f4:746" file="f4" line="746" offset="0"/>
  <Field id="_605" name="fDuration" type="_384" context="_286" access="public" location="f4:747" file="f4" line="747" offset="32"/>
  <Field id="_606" name="fFullyReceived" type="_690" context="_286" access="public" location="f4:748" file="f4" line="748" offset="64"/>
  <Field id="_607" name="fAlphaType" type="_48" context="_286" access="public" location="f4:749" file="f4" line="749" offset="96"/>
  <Field id="_608" name="fDisposalMethod" type="_285" context="_286" access="public" location="f4:750" file="f4" line="750" offset="128"/>
  <ElaboratedType id="_609" type="_286"/>
  <ElaboratedType id="_610" type="_288"/>
  <ElaboratedType id="_611" type="_290"/>
  <ElaboratedType id="_612" type="_292"/>
  <ElaboratedType id="_613" type="_294"/>
  <ElaboratedType id="_614" type="_296"/>
  <ElaboratedType id="_615" type="_298"/>
  <ElaboratedType id="_616" type="_300"/>
  <ElaboratedType id="_617" type="_302"/>
  <ElaboratedType id="_618" type="_304"/>
  <ElaboratedType id="_619" type="_306"/>
  <Field id="_620" name="fG" type="_682" context="_308" access="public" location="f4:794" file="f4" line="794" offset="0"/>
  <Field id="_621" name="fA" type="_682" context="_308" access="public" location="f4:795" file="f4" line="795" offset="32"/>
  <Field id="_622" name="fB" type="_682" context="_308" access="public" location="f4:796" file="f4" line="796" offset="64"/>
  <Field id="_623" name="fC" type="_682" context="_308" access="public" location="f4:797" file="f4" line="797" offset="96"/>
  <Field id="_624" name="fD" type="_682" context="_308" access="public" location="f4:798" file="f4" line="798" offset="128"/>
  <Field id="_625" name="fE" type="_682" context="_308" access="public" location="f4:799" file="f4" line="799" offset="160"/>
  <Field id="_626" name="fF" type="_682" context="_308" access="public" location="f4:800" file="f4" line="800" offset="192"/>
  <ElaboratedType id="_627" type="_308"/>
  <Field id="_628" name="fRX" type="_682" context="_310" access="public" location="f4:804" file="f4" line="804" offset="0"/>
  <Field id="_629" name="fRY" type="_682" context="_310" access="public" location="f4:805" file="f4" line="805" offset="32"/>
  <Field id="_630" name="fGX" type="_682" context="_310" access="public" location="f4:806" file="f4" line="806" offset="64"/>
  <Field id="_631" name="fGY" type="_682" context="_310" access="public" location="f4:807" file="f4" line="807" offset="96"/>
  <Field id="_632" name="fBX" type="_682" context="_310" access="public" location="f4:808" file="f4" line="808" offset="128"/>
  <Field id="_633" name="fBY" type="_682" context="_310" access="public" location="f4:809" file="f4" line="809" offset="160"/>
  <Field id="_634" name="fWX" type="_682" context="_310" access="public" location="f4:810" file="f4" line="810" offset="192"/>
  <Field id="_635" name="fWY" type="_682" context="_310" access="public" location="f4:811" file="f4" line="811" offset="224"/>
  <ElaboratedType id="_636" type="_310"/>
  <ElaboratedType id="_637" type="_312"/>
  <Field id="_638" name="fGrayscale" type="_690" context="_314" access="public" location="f4:821" file="f4" line="821" offset="0"/>
  <Field id="_639" name="fInvertStyle" type="_313" context="_314" access="public" location="f4:822" file="f4" line="822" offset="32"/>
  <Field id="_640" name="fContrast" type="_682" context="_314" access="public" location="f4:823" file="f4" line="823" offset="64"/>
  <ElaboratedType id="_641" type="_314"/>
  <ElaboratedType id="_642" type="_316"/>
  <Field id="_643" name="fFilterFlags" type="_317" context="_318" access="public" location="f4:841" file="f4" line="841" offset="0"/>
  <Field id="_644" name="fZLibLevel" type="_384" context="_318" access="public" location="f4:842" file="f4" line="842" offset="32"/>
  <Field id="_645" name="fUnpremulBehavior" type="_188" context="_318" access="public" location="f4:843" file="f4" line="843" offset="64"/>
  <Field id="_646" name="fComments" type="_716" context="_318" access="public" location="f4:844" file="f4" line="844" offset="128"/>
  <ElaboratedType id="_647" type="_318"/>
  <ElaboratedType id="_648" type="_320"/>
  <ElaboratedType id="_649" type="_322"/>
  <Field id="_650" name="fQuality" type="_384" context="_324" access="public" location="f4:859" file="f4" line="859" offset="0"/>
  <Field id="_651" name="fDownsample" type="_321" context="_324" access="public" location="f4:860" file="f4" line="860" offset="32"/>
  <Field id="_652" name="fAlphaOption" type="_323" context="_324" access="public" location="f4:861" file="f4" line="861" offset="64"/>
  <Field id="_653" name="fBlendBehavior" type="_188" context="_324" access="public" location="f4:862" file="f4" line="862" offset="96"/>
  <ElaboratedType id="_654" type="_324"/>
  <ElaboratedType id="_655" type="_326"/>
  <Field id="_656" name="fCompression" type="_327" context="_328" access="public" location="f4:871" file="f4" line="871" offset="0"/>
  <Field id="_657" name="fQuality" type="_682" context="_328" access="public" location="f4:872" file="f4" line="872" offset="32"/>
  <Field id="_658" name="fUnpremulBehavior" type="_188" context="_328" access="public" location="f4:873" file="f4" line="873" offset="64"/>
  <ElaboratedType id="_659" type="_328"/>
  <ElaboratedType id="_660" type="_330"/>
  <ElaboratedType id="_661" type="_332"/>
  <ElaboratedType id="_662" type="_334"/>
  <ElaboratedType id="_663" type="_336"/>
  <ElaboratedType id="_664" type="_338"/>
  <Field id="_665" name="glyphs" type="_716" context="_340" access="public" location="f4:897" file="f4" line="897" offset="0"/>
  <Field id="_666" name="pos" type="_716" context="_340" access="public" location="f4:898" file="f4" line="898" offset="64"/>
  <Field id="_667" name="utf8text" type="_716" context="_340" access="public" location="f4:899" file="f4" line="899" offset="128"/>
  <Field id="_668" name="clusters" type="_716" context="_340" access="public" location="f4:900" file="f4" line="900" offset="192"/>
  <ElaboratedType id="_669" type="_340"/>
  <Field id="_670" name="fSCos" type="_682" context="_342" access="public" location="f4:904" file="f4" line="904" offset="0"/>
  <Field id="_671" name="fSSin" type="_682" context="_342" access="public" location="f4:905" file="f4" line="905" offset="32"/>
  <Field id="_672" name="fTX" type="_682" context="_342" access="public" location="f4:906" file="f4" line="906" offset="64"/>
  <Field id="_673" name="fTY" type="_682" context="_342" access="public" location="f4:907" file="f4" line="907" offset="96"/>
  <ElaboratedType id="_674" type="_342"/>
  <PointerType id="_675" type="_121" size="64" align="64"/>
  <PointerType id="_676" type="_61c" size="64" align="64"/>
  <CvQualifiedType id="_61c" type="_61" const="1"/>
  <FundamentalType id="_677" name="void" size="0" align="8"/>
  <PointerType id="_678" type="_61" size="64" align="64"/>
  <PointerType id="_679" type="_119" size="64" align="64"/>
  <PointerType id="_680" type="_63c" size="64" align="64"/>
  <CvQualifiedType id="_63c" type="_63" const="1"/>
  <PointerType id="_681" type="_97c" size="64" align="64"/>
  <CvQualifiedType id="_97c" type="_97" const="1"/>
  <FundamentalType id="_682" name="float" size="32" align="32"/>
  <PointerType id="_683" type="_121c" size="64" align="64"/>
  <CvQualifiedType id="_121c" type="_121" const="1"/>
  <PointerType id="_684" type="_117" size="64" align="64"/>
  <PointerType id="_685" type="_101c" size="64" align="64"/>
  <CvQualifiedType id="_101c" type="_101" const="1"/>
  <PointerType id="_686" type="_107c" size="64" align="64"/>
  <CvQualifiedType id="_107c" type="_107" const="1"/>
  <PointerType id="_687" type="_682c" size="64" align="64"/>
  <CvQualifiedType id="_682c" type="_682" const="1"/>
  <ArrayType id="_688" min="0" max="" type="_682c"/>
  <PointerType id="_689" type="_103c" size="64" align="64"/>
  <CvQualifiedType id="_103c" type="_103" const="1"/>
  <FundamentalType id="_690" name="_Bool" size="8" align="8"/>
  <PointerType id="_691" type="_679" size="64" align="64"/>
  <ArrayType id="_692" min="0" max="" type="_679"/>
  <PointerType id="_693" type="_89" size="64" align="64"/>
  <PointerType id="_694" type="_81" size="64" align="64"/>
  <PointerType id="_695" type="_85c" size="64" align="64"/>
  <CvQualifiedType id="_85c" type="_85" const="1"/>
  <Field id="_696" name="isa" type="_706" context="_379" access="public" offset="0"/>
  <Field id="_697" name="flags" type="_384" context="_379" access="public" offset="64"/>
  <Field id="_698" name="str" type="_717" context="_379" access="public" offset="128"/>
  <Field id="_699" name="length" type="_390" context="_379" access="public" offset="192"/>
  <Struct id="_701" name="__va_list_tag" context="_1" location="f0:0" file="f0" line="0" members="_718 _719 _720 _721" size="192" align="64"/>
  <PointerType id="_702" type="_59" size="64" align="64"/>
  <PointerType id="_703" type="_26" size="64" align="64"/>
  <PointerType id="_706" type="_384c" size="64" align="64"/>
  <CvQualifiedType id="_384c" type="_384" const="1"/>
  <PointerType id="_707" type="_262c" size="64" align="64"/>
  <CvQualifiedType id="_262c" type="_262" const="1"/>
  <PointerType id="_708" type="_59c" size="64" align="64"/>
  <CvQualifiedType id="_59c" type="_59" const="1"/>
  <PointerType id="_709" type="_43c" size="64" align="64"/>
  <CvQualifiedType id="_43c" type="_43" const="1"/>
  <PointerType id="_713" type="_111" size="64" align="64"/>
  <PointerType id="_714" type="_279" size="64" align="64"/>
  <PointerType id="_715" type="_134" size="64" align="64"/>
  <PointerType id="_716" type="_677" size="64" align="64"/>
  <PointerType id="_717" type="_700c" size="64" align="64"/>
  <CvQualifiedType id="_700c" type="_700" const="1"/>
  <Field id="_718" name="gp_offset" type="_385" context="_701" access="public" offset="0"/>
  <Field id="_719" name="fp_offset" type="_385" context="_701" access="public" offset="32"/>
  <Field id="_720" name="overflow_arg_area" type="_716" context="_701" access="public" offset="64"/>
  <Field id="_721" name="reg_save_area" type="_716" context="_701" access="public" offset="128"/>
  <FundamentalType id="_700" name="char" size="8" align="8"/>
  <FunctionType id="_704" returns="_677"/>
  <FunctionType id="_705" returns="_249">
    <Argument type="_716"/>
    <Argument type="_717"/>
  </FunctionType>
  <FunctionType id="_710" returns="_677">
    <Argument type="_716"/>
    <Argument type="_716"/>
  </FunctionType>
  <FunctionType id="_711" returns="_677">
    <Argument type="_722"/>
    <Argument type="_716"/>
  </FunctionType>
  <FunctionType id="_712" returns="_677">
    <Argument type="_716"/>
  </FunctionType>
  <PointerType id="_722" type="_677c" size="64" align="64"/>
  <CvQualifiedType id="_677c" type="_677" const="1"/>
  <File id="f0" name="&lt;builtin&gt;"/>
  <File id="f1" name="/usr/local/Cellar/castxml/0.2.0/share/castxml/clang/include/stdint.h"/>
  <File id="f2" name="/usr/local/Cellar/castxml/0.2.0/share/castxml/clang/include/stddef.h"/>
  <File id="f3" name="/usr/local/Cellar/castxml/0.2.0/share/castxml/clang/include/__stddef_max_align_t.h"/>
  <File id="f4" name="./c/sk_types.h"/>
  <File id="f5" name="./c/sk_imagefilter.h"/>
</CastXML>
